[
    {
        "id": 1,
        "image": "https://i.ibb.co.com/ZzY5PXK/townhouse-5976587-1280.jpg",
        "estate_title": "Modern Family Townhouse",
        "segment_name": "Urban Luxury",
        "description": "This spacious townhouse offers a perfect blend of contemporary design and family-friendly layout, featuring open spaces, ample natural light, and high-end finishes throughout. With a private backyard and a luxurious master suite, it’s an ideal retreat for those seeking a comfortable and elegant lifestyle in the city. The kitchen comes with premium appliances, perfect for culinary adventures, and the living room is designed for relaxing family gatherings. Nearby parks and shopping centers enhance the living experience in this welcoming community.",
        "price": "$500,000",
        "status": "For Sale",
        "bed": "3 Bed",
        "bath": "2 Bath",
        "area": "2000 sqft",
        "location": "Downtown, City Center",
        "facilities": ["living room", "swimming pool", "kitchen"]
    },
    {
        "id": 2,
        "image": "https://i.ibb.co.com/MP5VQh2/house-1507920-1280.jpg",
        "estate_title": "Charming Suburban Townhouse",
        "segment_name": "Suburban Comfort",
        "description": "Located in a peaceful suburban neighborhood, this townhouse combines charm and functionality. The spacious living area flows into a modern kitchen equipped with stainless steel appliances, ideal for home chefs and entertainers. Upstairs, find cozy bedrooms and an inviting master suite with a walk-in closet. Enjoy a private garden and outdoor seating area, perfect for relaxing weekends. Close to schools, parks, and shopping centers, this home is a sanctuary for families looking for a tranquil lifestyle.",
        "price": "$450,000",
        "status": "For Sale",
        "bed": "3 Bed",
        "bath": "2 Bath",
        "area": "2100 sqft",
        "location": "Greenfield Suburb",
        "facilities": ["living room", "garden", "kitchen"]
    },
    {
        "id": 3,
        "image": "https://i.ibb.co.com/JmJRg3C/townhouse-5976262-1280.jpg",
        "estate_title": "Luxury Riverside Townhouse",
        "segment_name": "Riverside Elegance",
        "description": "This exceptional townhouse is located along the riverbank, providing scenic water views and a sense of tranquility. Designed with attention to detail, it boasts a spacious open-plan living area with floor-to-ceiling windows that bring in natural light. The gourmet kitchen is equipped with custom cabinetry and high-end finishes, while the master suite includes a private balcony overlooking the river. Ideal for those seeking a luxurious, peaceful living environment with the convenience of city amenities nearby.",
        "price": "$800,000",
        "status": "For Sale",
        "bed": "3 Bed",
        "bath": "2 Bath",
        "area": "2500 sqft",
        "location": "Riverside District",
        "facilities": ["living room", "balcony", "kitchen"]
    },
    {
        "id": 4,
        "image": "https://i.ibb.co.com/zQMGHyd/elegant-1498631-1280.jpg",
        "estate_title": "Elegant Downtown Townhouse",
        "segment_name": "Downtown Living",
        "description": "Situated in the heart of the downtown area, this townhouse offers the ultimate city living experience with spacious interiors and a convenient location. Featuring a sleek modern design, the open-plan kitchen and living area are perfect for entertaining. The bedrooms are located on the second floor, each providing comfort and privacy. The home includes premium amenities and proximity to popular dining and shopping districts, making it ideal for urban professionals and families who enjoy city life.",
        "price": "$600,000",
        "status": "For Rent",
        "bed": "3 Bed",
        "bath": "2 Bath",
        "area": "1800 sqft",
        "location": "Downtown City Center",
        "facilities": ["living room", "city view", "kitchen"]
    },
    {
        "id": 5,
        "image": "https://i.ibb.co.com/kmwGCdL/house-1528960-1280.jpg",
        "estate_title": "Cozy Suburban Retreat",
        "segment_name": "Suburban Serenity",
        "description": "Nestled in a quiet suburban community, this cozy townhouse is perfect for families looking for a safe and peaceful environment. The open-plan kitchen and dining area provide a warm space for family gatherings, and the private backyard is ideal for outdoor activities. Close to schools and local parks, this townhouse offers both comfort and convenience, making it a fantastic choice for young families or retirees.",
        "price": "$350,000",
        "status": "For Sale",
        "bed": "3 Bed",
        "bath": "2 Bath",
        "area": "1900 sqft",
        "location": "Westside Suburbs",
        "facilities": ["living room", "backyard", "kitchen"]
    },
    {
        "id": 6,
        "image": "https://i.ibb.co.com/MNXmtM4/bedroom-670249-1280.jpg",
        "estate_title": "Seaside Townhouse Retreat",
        "segment_name": "Coastal Living",
        "description": "Located steps from the beach, this townhouse offers seaside living with style. The property features an open living area with large windows for natural light and ocean views. The modern kitchen includes high-end appliances and a breakfast bar. Enjoy the soothing ambiance and fresh air in this coastal townhouse, perfect for those seeking a relaxing lifestyle near the ocean.",
        "price": "$950,000",
        "status": "For Sale",
        "bed": "3 Bed",
        "bath": "2 Bath",
        "area": "2300 sqft",
        "location": "Seaside Avenue",
        "facilities": ["living room", "ocean view", "kitchen"]
    },
    {
        "id": 7,
        "image": "https://i.ibb.co.com/cXK06km/white-4585653-1280.jpg",
        "estate_title": "Modern Suburban Oasis",
        "segment_name": "Suburban Luxe",
        "description": "This contemporary townhouse is situated in a vibrant suburban area, offering a mix of comfort and style. The property features a spacious living room, high ceilings, and a designer kitchen with modern appliances. The master suite offers a peaceful retreat with an en-suite bath and a walk-in closet. Community parks, schools, and shopping areas are within close reach, making it an ideal choice for families.",
        "price": "$400,000",
        "status": "For Rent",
        "bed": "3 Bed",
        "bath": "2 Bath",
        "area": "2100 sqft",
        "location": "Springfield Suburb",
        "facilities": ["living room", "park access", "kitchen"]
    },
    {
        "id": 8,
        "image": "https://i.ibb.co.com/KwTDryY/row-houses-196105-1280.jpg",
        "estate_title": "Sophisticated City Townhouse",
        "segment_name": "City Sophistication",
        "description": "A stylish townhouse located in the heart of the city, ideal for those who love urban life. This property features modern architecture, an open-plan kitchen, and floor-to-ceiling windows that offer stunning city views. The spacious bedrooms and luxurious bathrooms provide comfort, while the proximity to cultural spots and dining areas enhances the urban experience.",
        "price": "$750,000",
        "status": "For Sale",
        "bed": "3 Bed",
        "bath": "2 Bath",
        "area": "2200 sqft",
        "location": "City Center",
        "facilities": ["living room", "city view", "kitchen"]
    },
    {
        "id": 9,
        "image": "https://i.ibb.co.com/wWySZ4N/lifestyle-3107041-1280.jpg",
        "estate_title": "Riverside Contemporary Townhouse",
        "segment_name": "Riverside Views",
        "description": "This townhouse offers a unique riverside living experience with modern design and high-end finishes. The spacious living area opens up to a private terrace with river views, perfect for relaxing and entertaining. The open kitchen includes stainless steel appliances and custom cabinets. Located close to riverfront parks and walking trails, this home combines luxury with the beauty of nature.",
        "price": "$820,000",
        "status": "For Rent",
        "bed": "3 Bed",
        "bath": "2 Bath",
        "area": "2400 sqft",
        "location": "Riverfront Community",
        "facilities": ["living room", "terrace", "kitchen"]
    }
]
